<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/1_Pivot_With_Case_Statements/3_Advanced_Segmentation.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Advanced Segmentation

## Overview

### ü•Ö Analysis Goals

Continue categorizing and analyzing product performance by revenue tiers to better understand sales patterns across categories. This segmentation provides insights into high-performing products.

- **üìä Revenue Tiers with Percentiles:** Segment sales into **Low, Medium, and High** based on the **25th (Q1) and 75th (Q3) percentiles** to establish meaningful thresholds for performance evaluation.
- **üìà Revenue Aggregation by Category & Tier:** Evaluate how different categories contribute to total sales by **aggregating revenue within each tier**.

### üìò Concepts Covered

- Pivot with multipledifferent aggregations
- Pivots with `AND` in a `CASE WHEN` Condition
- Pivoting with Multiple `WHEN` Clauses in a Single `CASE` Block

---

In [1]:
import sys
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

Connecting to 'postgresql://postgres:***@localhost:5432/contoso_100k'

---
## Using Multiple Aggregations

### üìù¬†Notes

**Pivot with multiple `CASE WHEN` statements for different aggregation functions** combines pivot operations like `COUNT` and `SUM`, each using separate `CASE WHEN` conditions.

- Syntax:

  ```sql
  SELECT
    COUNT(CASE WHEN condition THEN column END) AS count_alias,
    SUM(CASE WHEN condition THEN column ELSE 0 END) AS sum_alias
  FROM table_name;
  ```

- Example:

  ```sql
  SELECT
    COUNT(CASE WHEN category = 'A' THEN user_id END) AS category_a_users,
    SUM(CASE WHEN category = 'A' THEN revenue ELSE 0 END) AS category_a_revenue
  FROM user_data;
  ```

  This counts the users and sums the revenue for category A.

### üíª¬†Final Result

- Compare the performance of product categories in 2022 and 2023 by evaluating the total net revenue and the number of unique customers for each category. This will help identify the most popular categories based on revenue and customer engagement in both years.

#### Total Net Revenue and Customers (2022 vs 2023)

**`SUM`**, **`COUNT`**, **`CASE WHEN`**

1. Calculate total net revenue by category for 2022 and 2023.  
    - Use `SUM` to calculate net revenue as `quantity * netprice * exchangerate`.  
    - Use a `CASE WHEN` clause to filter sales data for 2022 and 2023 separately.  
    - Group the data by `categoryname` to get net revenue totals for each category.  
    - Order the results by `categoryname` for clarity.

In [2]:
%%sql

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN s.orderdate BETWEEN '2022-01-01' AND '2022-12-31' THEN (s.quantity * s.netprice * s.exchangerate) END) AS y2022_net_revenue,
    SUM(CASE WHEN s.orderdate BETWEEN '2023-01-01' AND '2023-12-31' THEN (s.quantity * s.netprice * s.exchangerate) END) AS y2023_net_revenue
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
GROUP BY   
    category
ORDER BY
    category

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

                        category  y2022_net_revenue  y2023_net_revenue
0                          Audio          766938.21          688690.18
1        Cameras and camcorders          2382532.56         1983546.29
2                    Cell phones         8119665.07         6002147.63
3                      Computers        17862213.49        11650867.21
4                 Games and Toys          316127.30          270374.96
5                Home Appliances         6612446.68         5919992.87
6  Music, Movies and Audio Books         2989297.28         2180768.13
7                   TV and Video         5815336.61         4412178.23

2. Extend the previous query to include unique customer counts for 2022 and 2023.  
    - üîî Use `COUNT(DISTINCT ...)` to calculate unique customers for each year.  
    - Add a `CASE WHEN` clause to filter customers for 2022 and 2023 separately.  
    - Retain the existing net revenue calculations from the previous query.  
    - Group and order by `categoryname` as in the first query.

In [3]:
%%sql

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN s.orderdate BETWEEN '2022-01-01' AND '2022-12-31' THEN (s.quantity * s.netprice * s.exchangerate) END) AS y2022_net_revenue,
    SUM(CASE WHEN s.orderdate BETWEEN '2023-01-01' AND '2023-12-31' THEN (s.quantity * s.netprice * s.exchangerate) END) AS y2023_net_revenue,
    COUNT(DISTINCT CASE WHEN s.orderdate BETWEEN '2022-01-01' AND '2022-12-31' THEN s.customerkey END) AS y2022_customers, -- Added
    COUNT(DISTINCT CASE WHEN s.orderdate BETWEEN '2023-01-01' AND '2023-12-31' THEN s.customerkey END) AS y2023_customers -- Added
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
GROUP BY   
    category
ORDER BY
    category

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

,category,y2022_net_revenue,y2023_net_revenue,y2022_customers,y2023_customers
0,Audio,766938.21,688690.18,1854,1547
1,Cameras and camcorders,2382532.56,1983546.29,1856,1544
2,Cell phones,8119665.07,6002147.63,8035,6881
3,Computers,17862213.49,11650867.21,8117,6505
4,Games and Toys,316127.30,270374.96,3431,2926
5,Home Appliances,6612446.68,5919992.87,3328,2769
6,"Music, Movies and Audio Books",2989297.28,2180768.13,6082,5169
7,TV and Video,5815336.61,4412178.23,3359,2369

<img src="../Resources/images/1.3_rev_customers.png" alt="Revenue And Customers" width="50%">

---

## Using AND in a CASE WHEN Condition

### üìù¬†Notes

**`AND` in a `CASE WHEN` condition** is used to combine multiple criteria that must all be true for the condition to apply. This allows for more specific filtering within a single `CASE` block.

- **Syntax**:

    ```sql
    SELECT
      COUNT(
        CASE 
          WHEN condition1 AND condition2 THEN column
        END
      ) AS alias
    FROM table_name;
    ```

- **Example**:

    ```sql
    SELECT
      COUNT(
        CASE 
          WHEN category = 'A' AND region = 'North' THEN user_id
        END
      ) AS category_a_north_users
    FROM user_data;
    ```

    This counts users where the category is 'A' **and** the region is 'North.'

### üíª¬†Final Result

- Categorizing net revenue into "low" and "high" using the median ensures meaningful divisions based on the actual data, instead of guessing. This let su easily compare revenue across categories or years.

#### Categorize as Low and High for Total Net Revenue

**`SUM`**, **`CASE WHEN`**, **`PERCENTILE_CONT`**

1. Use `PERCENTILE_CONT` to find the median net revenue between 2022 and 2023.  
    - Calculate the median by specifying `PERCENTILE_CONT(0.5)` within a `WITHIN GROUP (ORDER BY)` clause.  
    - Multiply `quantity`, `netprice`, and `exchangerate` to determine net revenue for each row.  
    - Filter the `sales` table for `orderdate` values between January 1, 2022, and December 31, 2023.

In [4]:
%%sql

SELECT 
    PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * s.exchangerate)) AS median
FROM 
    sales s
WHERE 
    orderdate BETWEEN '2022-01-01' AND '2023-12-31'

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

1 rows affected.

   median
0  398.00

2. Calculate total net revenue by category and categorize it into "low" and "high" based on the median.   
    - üîî Aggregate total net revenue for each category using `SUM`.  
    - üîî Classify rows as "low" or "high" using `CASE WHEN` with conditions comparing net revenue to the median value.  
        - "low" is `<` the median
        - "high" is `>=` the median
    - Filter the data for `orderdate` values between 2022 and 2023.  
    - üîî Group results by `categoryname` and order by category.

In [5]:
%%sql 

SELECT -- Updated
    p.categoryname AS category,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) < 398 
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS low_net_revenue,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) >= 398 
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS high_net_revenue
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey --Added 
WHERE
    orderdate BETWEEN '2022-01-01' AND '2023-12-31' 
GROUP BY
    category --Added 
ORDER BY
    category --Added 
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

                        category  low_net_revenue  high_net_revenue
0                          Audio        402588.95        1053039.44
1        Cameras and camcorders         237874.00        4128204.85
2                    Cell phones       1544148.92       12577663.79
3                      Computers       1215130.73       28297949.97
4                 Games and Toys        438083.00         148419.27
5                Home Appliances        396058.42       12136381.13
6  Music, Movies and Audio Books       1260767.25        3909298.16
7                   TV and Video        436613.64        9790901.19

3. Add year-based filters in `CASE WHEN` to calculate "low" and "high" net revenue for 2022 and 2023 separately.  
    - üîî Add conditions within `CASE WHEN` to filter `orderdate` by specific years (2022 or 2023).  
    - Categorize revenue into "low" or "high" based on comparisons with the median value.  
        - "low" is `<` the median
        - "high" is `>=` the median
    - Aggregate revenue for each category and year combination using `SUM`.  
    - Group the data by `categoryname` and order by category.

In [6]:
%%sql

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) < 398
             AND s.orderdate BETWEEN '2022-01-01' AND '2022-12-31' -- Added
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS low_revenue_2022,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) >= 398
             AND s.orderdate BETWEEN '2022-01-01' AND '2022-12-31' -- Added
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS high_revenue_2022,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) < 398
             AND s.orderdate BETWEEN '2023-01-01' AND '2023-12-31' -- Added
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS low_revenue_2023,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) >= 398
             AND s.orderdate BETWEEN '2023-01-01' AND '2023-12-31' -- Added
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS high_revenue_2023
FROM    
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
GROUP BY
    category
ORDER BY
    category;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

,category,low_revenue_2022,high_revenue_2022,low_revenue_2023,high_revenue_2023
0,Audio,222337.83,544600.39,180251.13,508439.06
1,Cameras and camcorders,133004.54,2249528.02,104869.46,1878676.83
2,Cell phones,814449.53,7305215.55,729699.39,5272448.24
3,Computers,624340.42,17237873.07,590790.31,11060076.90
4,Games and Toys,231979.63,84147.67,206103.36,64271.60
5,Home Appliances,219797.07,6392649.61,176261.35,5743731.52
6,"Music, Movies and Audio Books",685808.49,2303488.80,574958.76,1605809.37
7,TV and Video,272338.29,5542998.32,164275.35,4247902.87

4. Use a CTE to calculate the median dynamically and include it in the main query.
    - üîî Create a CTE using `PERCENTILE_CONT(0.5)` to calculate the median dynamically for all sales between 2022 and 2023.  
    - üîî Reference the CTE in the `FROM` clause to make the percentile values available in the main query without hardcoding thresholds.   
    - üîî Replace hardcoded median thresholds in `CASE WHEN` with the dynamically calculated median from the CTE.  
    - Filter and aggregate net revenue for "low" and "high" categories by year, grouped by category.

In [15]:
%%sql

-- Calculate the median values
WITH median_value AS (
    SELECT 
        PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * s.exchangerate)) AS median
    FROM sales s
    WHERE orderdate BETWEEN '2022-01-01' AND '2023-12-31'
)

SELECT
    p.categoryname AS category,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) < mv.median 
             AND s.orderdate BETWEEN '2022-01-01' AND '2022-12-31'
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS low_revenue_2022,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) >= mv.median 
             AND s.orderdate BETWEEN '2022-01-01' AND '2022-12-31'
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS high_revenue_2022,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) < mv.median 
             AND s.orderdate BETWEEN '2023-01-01' AND '2023-12-31'
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS low_revenue_2023,
    SUM(CASE WHEN (s.quantity * s.netprice * s.exchangerate) >= mv.median 
             AND s.orderdate BETWEEN '2023-01-01' AND '2023-12-31'
        THEN (s.quantity * s.netprice * s.exchangerate) END) AS high_revenue_2023
FROM    
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey,
    median_value mv  -- Alias applied here
GROUP BY
    category, mv.median  -- Include median in GROUP BY if needed
ORDER BY
    category;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

8 rows affected.

,category,low_revenue_2022,high_revenue_2022,low_revenue_2023,high_revenue_2023
0,Audio,222337.83,544600.39,180251.13,508439.06
1,Cameras and camcorders,133004.54,2249528.02,104869.46,1878676.83
2,Cell phones,814449.53,7305215.55,729699.39,5272448.24
3,Computers,624340.42,17237873.07,590790.31,11060076.90
4,Games and Toys,231979.63,84147.67,206103.36,64271.60
5,Home Appliances,219797.07,6392649.61,176261.35,5743731.52
6,"Music, Movies and Audio Books",685808.49,2303488.80,574958.76,1605809.37
7,TV and Video,272338.29,5542998.32,164275.35,4247902.87

<img src="../Resources/images/1.3_Rev_Spread.png" alt="Revenue Spread" width="50%">

---
## Multiple WHEN Clauses in a Single CASE Block

### üìù¬†Notes

**Pivot with multiple `WHEN` clauses in a single `CASE` block in the same aggregation function** applies multiple `WHEN` conditions within a single aggregation, such as `COUNT`.

- Syntax:

    ```sql
    SELECT
      COUNT(
        CASE 
          WHEN condition1 THEN column
          WHEN condition2 THEN column
        END
      ) AS alias
    FROM table_name;
    ```

- Example:

    ```sql
    SELECT
      COUNT(
        CASE 
          WHEN category = 'A' THEN user_id
          WHEN category = 'B' THEN user_id
        END
      ) AS category_a_b_users
    FROM user_data;
    ```

    This counts users where the category is either 'A' or 'B'.

### üíª¬†Final Result

- Categorize total net revenue for each product category into three tiers: low, medium, and high‚Äîbased on the 25th and 75th percentiles of individual sales. This helps us separate out the sales performance by category.

#### Categorize Low, Moderate and High for Net Revenue

**`SUM`**, **`CASE WHEN`**, **`PERCENTILE_CONT`**

1. Calculate the minimum, 25th percentile (Q1), 75th percentile (Q3), and maximum for net revenue between 2022 and 2023.
    - Find the 25th and 75th percentiles for net revenue using `PERCENTILE_CONT` with `WITHIN GROUP (ORDER BY)`.
    - Filter sales data for rows where `orderdate` is between 2022-01-01, and 2023-12-31.
    - These percentiles define thresholds for "Low" (below Q1), "Medium" (Q1 to Q3), and "High" (above Q3) categories.
        - Low: Below the 25th percentile (Q1).
        - Moderate: Between the 25th and 75th percentiles (Q1 and Q3).
        - High: Above the 75th percentile (Q3).

In [8]:
%%sql 

SELECT
    PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * exchangerate)) AS net_revenue_25th_percentile,
    PERCENTILE_CONT(0.75) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * exchangerate)) AS net_revenue_75th_percentile
FROM
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
WHERE
    orderdate BETWEEN '2022-01-01' AND '2023-12-31' 
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

1 rows affected.

   net_revenue_25th_percentile  net_revenue_75th_percentile
0                       111.07                      1062.12

2. Pivot by category and segment sales into revenue tiers based on the calculated percentiles.
    - Categorize each sale using a `CASE` statement:
        - "Low" for revenue below the 25th percentile.
        - "Medium" for revenue between the 25th and 75th percentiles.
        - "High" for revenue above the 75th percentile.
    - Aggregate total net revenue for each category and tier using `SUM(quantity * netprice * exchangerate)`.
    - Group the results by `categoryname` and `revenue_tier` for meaningful segmentation.

In [9]:
%%sql

SELECT
    p.categoryname AS category,
    CASE 
        WHEN (s.quantity * s.netprice * exchangerate) < 111 THEN 'Low'
        WHEN (s.quantity * s.netprice * exchangerate) BETWEEN 111 AND 1062 THEN 'Medium'
        ELSE 'High'
    END AS revenue_tier,
    SUM(s.quantity * s.netprice * exchangerate) AS total_net_revenue
FROM    
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
GROUP BY
    category, 
    revenue_tier
ORDER BY
    category, 
    revenue_tier;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

24 rows affected.

                         category revenue_tier  total_net_revenue
0                           Audio         High         1213265.71
1                           Audio          Low          266883.91
2                           Audio       Medium         3832748.48
3         Cameras and camcorders          High        15050781.63
4         Cameras and camcorders           Low           81032.92
5         Cameras and camcorders        Medium         3388546.10
6                     Cell phones         High        21877117.16
7                     Cell phones          Low          410198.29
8                     Cell phones       Medium        10336950.26
9                       Computers         High        79617319.57
10                      Computers          Low          203096.00
11                      Computers       Medium        10798606.48
12                 Games and Toys         High          133749.09
13                 Games and Toys          Low          533443.13
14                 Games and Toys       Medium         1001381.91
15                Home Appliances         High        22383475.30
16                Home Appliances          Low          104934.53
17                Home Appliances       Medium         4118835.70
18  Music, Movies and Audio Books         High         3844996.29
19  Music, Movies and Audio Books          Low          642385.71
20  Music, Movies and Audio Books       Medium         6100928.99
21                   TV and Video         High        16632856.33
22                   TV and Video          Low           66999.64
23                   TV and Video       Medium         3767005.42

3. Update the revenue tiers to include numeric labels for better sorting (e.g. before is sorted alphabetically) and readability.
    - üîî Adjust the `CASE` statement to prepend numerical labels to tiers: 
        - "1 - High," 
        - "2 - Medium," 
        - "3 - Low."
    - Keep the same aggregation, grouping logic, and order as in the previous step.

In [10]:
%%sql

SELECT
    p.categoryname AS category,
    CASE 
        WHEN (s.quantity * s.netprice * exchangerate) < 111 THEN '3 - Low' -- Updated
        WHEN (s.quantity * s.netprice * exchangerate) BETWEEN 111 AND 1062 THEN '2- Medium' -- Updated
        ELSE '1- High' -- Updated
    END AS revenue_tier,
    SUM(s.quantity * s.netprice * exchangerate) AS total_net_revenue
FROM    
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
GROUP BY
    category, 
    revenue_tier
ORDER BY
    category, 
    revenue_tier;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

24 rows affected.

                         category revenue_tier  total_net_revenue
0                           Audio      1- High         1213265.71
1                           Audio    2- Medium         3832748.48
2                           Audio      3 - Low          266883.91
3         Cameras and camcorders       1- High        15050781.63
4         Cameras and camcorders     2- Medium         3388546.10
5         Cameras and camcorders       3 - Low           81032.92
6                     Cell phones      1- High        21877117.16
7                     Cell phones    2- Medium        10336950.26
8                     Cell phones      3 - Low          410198.29
9                       Computers      1- High        79617319.57
10                      Computers    2- Medium        10798606.48
11                      Computers      3 - Low          203096.00
12                 Games and Toys      1- High          133749.09
13                 Games and Toys    2- Medium         1001381.91
14                 Games and Toys      3 - Low          533443.13
15                Home Appliances      1- High        22383475.30
16                Home Appliances    2- Medium         4118835.70
17                Home Appliances      3 - Low          104934.53
18  Music, Movies and Audio Books      1- High         3844996.29
19  Music, Movies and Audio Books    2- Medium         6100928.99
20  Music, Movies and Audio Books      3 - Low          642385.71
21                   TV and Video      1- High        16632856.33
22                   TV and Video    2- Medium         3767005.42
23                   TV and Video      3 - Low           66999.64

4. Dynamically calculate the percentiles using a CTE and incorporate them into the main query.
    - üîî Create a CTE (`WITH percentiles`) to calculate the 25th and 75th percentiles dynamically.  
    - üîî Reference the CTE in the `FROM` clause to make the percentile values available in the main query without hardcoding thresholds.  
    - üîî Replace static values in the `CASE` statement with percentile values from the CTE.  
    - Aggregate and categorize sales as in the previous steps while ensuring dynamic percentile usage.

In [11]:
%%sql

-- Calcuulate the percentiles, ADDED 
WITH percentiles AS (
    SELECT
        PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * exchangerate)) AS net_revenue_25th_percentile,
        PERCENTILE_CONT(0.75) WITHIN GROUP (ORDER BY (s.quantity * s.netprice * exchangerate)) AS net_revenue_75th_percentile
    FROM
        sales s
    WHERE
        orderdate BETWEEN '2022-01-01' AND '2023-12-31'
)
SELECT
    p.categoryname AS category,
    CASE 
        WHEN (s.quantity * s.netprice * exchangerate) < pctl.net_revenue_25th_percentile THEN '3 - Low' -- Updated  
        WHEN (s.quantity * s.netprice * exchangerate) BETWEEN pctl.net_revenue_25th_percentile AND pctl.net_revenue_75th_percentile THEN '2 - Medium' -- Updated
        ELSE '1 - High' 
    END AS revenue_tier,
    SUM(s.quantity * s.netprice * exchangerate) AS total_sales
FROM    
    sales s
    LEFT JOIN product p ON s.productkey = p.productkey
    CROSS JOIN percentiles pctl -- Join percentiles as a single-row dataset, ADDED
GROUP BY
    category, 
    revenue_tier
ORDER BY
    category, 
    revenue_tier
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

24 rows affected.

                         category revenue_tier  total_sales
0                           Audio     1 - High   1213265.71
1                           Audio   2 - Medium   3832415.38
2                           Audio      3 - Low    267217.01
3         Cameras and camcorders      1 - High  15050781.63
4         Cameras and camcorders    2 - Medium   3388546.10
5         Cameras and camcorders       3 - Low     81032.92
6                     Cell phones     1 - High  21874993.15
7                     Cell phones   2 - Medium  10338963.22
8                     Cell phones      3 - Low    410309.35
9                       Computers     1 - High  79607760.89
10                      Computers   2 - Medium  10808054.11
11                      Computers      3 - Low    203207.06
12                 Games and Toys     1 - High    133749.09
13                 Games and Toys   2 - Medium   1001381.91
14                 Games and Toys      3 - Low    533443.13
15                Home Appliances     1 - High  22383475.30
16                Home Appliances   2 - Medium   4118724.64
17                Home Appliances      3 - Low    105045.60
18  Music, Movies and Audio Books     1 - High   3844996.29
19  Music, Movies and Audio Books   2 - Medium   6100817.99
20  Music, Movies and Audio Books      3 - Low    642496.71
21                   TV and Video     1 - High  16632856.33
22                   TV and Video   2 - Medium   3766783.30
23                   TV and Video      3 - Low     67221.76

<img src="../Resources/images/1.3_Rev_Tiers_Grouped.png" alt="Revenue Tiers Grouped" width="50%">
<img src="../Resources/images/1.3_Rev_Tiers_Stacked.png" alt="Revenue Tiers Stacked" width="50%">